Docs/Reference/Content/images/dependencies/net10.0/d2/alloverit-entityframeworkcore-pagination.d2
direction: left

aoi: AllOverIt
aoi.alloverit-entityframeworkcore-pagination: AllOverIt.EntityFrameworkCore.Pagination
aoi.alloverit-entityframeworkcore: AllOverIt.EntityFrameworkCore
microsoft-entityframeworkcore-relational_10-0-9: Microsoft.EntityFrameworkCore.Relational\nv10.0.9
microsoft-entityframeworkcore_10-0-9: Microsoft.EntityFrameworkCore\nv10.0.9
microsoft-extensions-caching-memory_10-0-9: Microsoft.Extensions.Caching.Memory\nv10.0.9
microsoft-extensions-configuration-abstractions_10-0-9: Microsoft.Extensions.Configuration.Abstractions\nv10.0.9
microsoft-extensions-logging_10-0-9: Microsoft.Extensions.Logging\nv10.0.9
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
aoi.alloverit-pagination: AllOverIt.Pagination
microsoft-extensions-dependencyinjection-abstractions_10-0-9: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.9
aoi.alloverit-serialization-binary: AllOverIt.Serialization.Binary
aoi.alloverit-entityframeworkcore <- aoi.alloverit-entityframeworkcore-pagination
microsoft-entityframeworkcore-relational_10-0-9 <- aoi.alloverit-entityframeworkcore
microsoft-entityframeworkcore_10-0-9 <- microsoft-entityframeworkcore-relational_10-0-9
microsoft-extensions-caching-memory_10-0-9 <- microsoft-entityframeworkcore-relational_10-0-9
microsoft-extensions-configuration-abstractions_10-0-9 <- microsoft-entityframeworkcore-relational_10-0-9
microsoft-extensions-logging_10-0-9 <- microsoft-entityframeworkcore-relational_10-0-9
aoi.alloverit <- aoi.alloverit-entityframeworkcore
aoi.alloverit-assertion <- aoi.alloverit
aoi.alloverit-pagination <- aoi.alloverit-entityframeworkcore-pagination
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- aoi.alloverit-pagination
aoi.alloverit-serialization-binary <- aoi.alloverit-pagination
aoi.alloverit <- aoi.alloverit-serialization-binary
microsoft-entityframeworkcore-relational_10-0-9.style.fill: "#ADD8E6"
microsoft-entityframeworkcore-relational_10-0-9.style.opacity: 0.8
microsoft-entityframeworkcore_10-0-9.style.fill: "#FFEC96"
microsoft-entityframeworkcore_10-0-9.style.opacity: 0.8
microsoft-extensions-caching-memory_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-caching-memory_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-logging_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging_10-0-9.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
